<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=3]
data.assert_test.workspace: Read complete after 0s
data.aws_ecr_repository.repository: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
module.ecs.aws_iam_user_policy_attachment.prometheus_query_policy: Refreshing state... [id=prometheus_sigv4_proxy_staging_rpc-proxy-20230524130533934500000001]
module.ecs.aws_security_group.vpc_app_ingress_internal: Refreshing state... [id=sg-036c3268f6010c0ab]
aws_kms_key.analytics_bucket: Refreshing state... [id=8df8e26c-8045-4e01-b4a9-a35f64114cb4]
module.ecs.aws_iam_user.prometheus_proxy: Refreshing state... [id=prometheus_sigv4_proxy_staging_rpc-proxy]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.backup_dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/5ebe08a2-8357-4b47-be63-d48dd5e4e2d1]
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.data.aws_ecr_image.service_image: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.backup_dns.data.aws_route53_zone.hosted_zone: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z09669243E0Q6ZCWCIW2U]
module.ecs.data.aws_vpc.vpc: Reading...
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:02c73c231127dc7bb1be8c78937635f5396392e1b240d16a89192daed8c2d597]
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_geoip_bucket_access]
module.logging.aws_s3_bucket.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
module.ecs.aws_iam_access_key.prometheus_proxy_key: Refreshing state... [id=AKIA5COABPQXVLUXFMHB]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.backup_dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z025697917GKV1T3MTR7I]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/rpc-proxy/staging]
module.redis.data.aws_vpc.vpc: Reading...
module.backup_dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z025697917GKV1T3MTR7I__4d22d935f4bfd18f85fd77a386484a45.staging.rpc.walletconnect.org._CNAME]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20221214151939690500000001]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.ecs.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_security_group.tls_ingress: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.aws_security_group.vpc-endpoint-group: Refreshing state... [id=sg-005aff40b5c233a8d]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=4]
module.ecs.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_vpc_endpoint.prometheus: Refreshing state... [id=vpce-0c2e5edcaf2c30e2e]
module.redis.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.redis.data.aws_subnets.private_subnets: Reading...
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0dc8dc9dd50d9922f]
module.ecs.data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.redis.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics-data-lake_bucket_access]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20221214151940178400000002]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_public_access_block.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_lifecycle_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
aws_s3_bucket_logging.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.logging.aws_s3_bucket_acl.logging_bucket-acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs,log-delivery-write]
module.logging.data.aws_iam_policy_document.allow_logging_service: Reading...
module.logging.data.aws_iam_policy_document.allow_logging_service: Read complete after 0s [id=3646663536]
module.logging.aws_s3_bucket_versioning.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_policy.allow_logging_service: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]
module.ecs.aws_route53_record.backup_dns_load_balancer: Refreshing state... [id=Z025697917GKV1T3MTR7I_staging.rpc.walletconnect.org_A]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_lb_listener_certificate.backup_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5_arn:aws:acm:eu-central-1:898587786287:certificate/5ebe08a2-8357-4b47-be63-d48dd5e4e2d1]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=0:staging_rpc-proxy]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_target.ecs_target: Refreshing state... [id=service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_appautoscaling_policy.cpu_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-cpu]
module.ecs.aws_appautoscaling_policy.memory_scaling: Refreshing state... [id=staging_rpc-proxy-application-scaling-policy-memory]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
      ~ tags               = {
          - "Name" = "rpc-proxy" -> null
        }
      ~ tags_all           = {
          - "Name"             = "rpc-proxy" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:102" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-036c3268f6010c0ab",
              - "sg-0f3c213ea19bfc4d7",
              - "sg-0fdb388e2b1c042d3",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:102" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 102 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_role_policy_attachment.attachment will be created
  + resource "aws_iam_role_policy_attachment" "attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonPrometheusQueryAccess"
      + role       = "staging_rpc-proxy_ecs_task_execution_role"
    }

  # module.ecs.aws_iam_user_policy_attachment.prometheus_query_policy will be destroyed
  # (because aws_iam_user_policy_attachment.prometheus_query_policy is not in configuration)
  - resource "aws_iam_user_policy_attachment" "prometheus_query_policy" {
      - id         = "prometheus_sigv4_proxy_staging_rpc-proxy-20230524130533934500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonPrometheusQueryAccess" -> null
      - user       = "prometheus_sigv4_proxy_staging_rpc-proxy" -> null
    }

  # module.ecs.aws_security_group.sigv4_proxy_vpc_ingress will be created
  + resource "aws_security_group" "sigv4_proxy_vpc_ingress" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from inside of vpc to sigv4"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "allow traffic from inside of cidr block to sigv4 proxy"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "staging_rpc-proxy-vpc-ingress-to-sigv4"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-09dce0b23af575478"
    }

  # module.ecs.aws_security_group.vpc-endpoint-group must be replaced
-/+ resource "aws_security_group" "vpc-endpoint-group" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-005aff40b5c233a8d" -> (known after apply)
      ~ description            = "Allow tls ingress from everywhere" -> "Allow tls ingress from VPC" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "allow all traffic from the proxy to VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-005aff40b5c233a8d" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "allow TLS traffic from vpc to the proxy"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "staging.eu-central-1.staging_rpc-proxy-vpc-endpoint"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
        tags                   = {
            "Application" = "staging_rpc-proxy"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.vpc_app_ingress_internal will be destroyed
  # (because aws_security_group.vpc_app_ingress_internal is not in configuration)
  - resource "aws_security_group" "vpc_app_ingress_internal" {
      - arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-036c3268f6010c0ab" -> null
      - description            = "Allow ingress from inside of vpc to sigv4" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-036c3268f6010c0ab" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.192.0.0/16",
                ]
              - description      = "allow traffic from inside of cidr block to sigv4 proxy"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "staging_rpc-proxy-vpc-ingress-to-sigv4" -> null
      - owner_id               = "898587786287" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Application"      = "rpc-proxy"
          - "Env"              = "staging"
          - "EnvironmentGroup" = "walletconnect"
          - "ProvisionedBy"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-09dce0b23af575478" -> null
    }

  # module.ecs.aws_vpc_endpoint.prometheus will be updated in-place
  ~ resource "aws_vpc_endpoint" "prometheus" {
        id                    = "vpce-0c2e5edcaf2c30e2e"
      ~ security_group_ids    = [
          - "sg-005aff40b5c233a8d",
        ] -> (known after apply)
        tags                  = {
            "Application" = "staging_rpc-proxy"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.grafana_dashboard.at_a_glance will be updated in-place
  ~ resource "grafana_dashboard" "at_a_glance" {
      ~ config_json  = jsonencode(
          ~ {
              ~ panels               = [
                    # (1 unchanged element hidden)
                    {
                        datasource  = {
                            type = "prometheus"
                            uid  = "XZpvvGQ4z"
                        }
                        fieldConfig = {
                            defaults  = {
                                color      = {
                                    mode = "palette-classic"
                                }
                                custom     = {
                                    axisCenteredZero  = false
                                    axisColorMode     = "text"
                                    axisLabel         = ""
                                    axisPlacement     = "auto"
                                    barAlignment      = 0
                                    drawStyle         = "line"
                                    fillOpacity       = 0
                                    gradientMode      = "none"
                                    hideFrom          = {
                                        legend  = false
                                        tooltip = false
                                        viz     = false
                                    }
                                    lineInterpolation = "linear"
                                    lineWidth         = 1
                                    pointSize         = 5
                                    scaleDistribution = {
                                        type = "linear"
                                    }
                                    showPoints        = "auto"
                                    spanNulls         = false
                                    stacking          = {
                                        group = "A"
                                        mode  = "none"
                                    }
                                    thresholdsStyle   = {
                                        mode = "off"
                                    }
                                }
                                mappings   = []
                                max        = 100
                                min        = 0
                                thresholds = {
                                    mode  = "absolute"
                                    steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                        {
                                            color = "red"
                                            value = 80
                                        },
                                    ]
                                }
                                unit       = "percent"
                            }
                            overrides = []
                        }
                        gridPos     = {
                            h = 9
                            w = 8
                            x = 0
                            y = 1
                        }
                        options     = {
                            legend  = {
                                calcs       = []
                                displayMode = "list"
                                placement   = "bottom"
                                showLegend  = true
                            }
                            tooltip = {
                                mode = "single"
                                sort = "none"
                            }
                        }
                        targets     = [
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "XZpvvGQ4z"
                                }
                                exemplar     = false
                                expr         = "sum(rate(http_call_counter{aws_ecs_task_family=\"staging_rpc-proxy\",code=~\"5.+\"}[5m])) or vector(0)"
                                hide         = true
                                interval     = ""
                                legendFormat = ""
                                refId        = "A"
                            },
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "XZpvvGQ4z"
                                }
                                exemplar     = true
                                expr         = "sum(rate(http_call_counter{aws_ecs_task_family=\"staging_rpc-proxy\"}[5m]))"
                                hide         = true
                                interval     = ""
                                legendFormat = ""
                                refId        = "B"
                            },
                            {
                                datasource = {
                                    type = "__expr__"
                                    uid  = "__expr__"
                                }
                                expression = "(1-(($A+$C)/$B))*100"
                                hide       = false
                                refId      = "Availability"
                                type       = "math"
                            },
                            {
                                datasource   = {
                                    type = "prometheus"
                                    uid  = "XZpvvGQ4z"
                                }
                                exemplar     = true
                                expr         = "sum(rate(http_call_counter{aws_ecs_task_family=\"staging_rpc-proxy\",code=\"429\"}[5m])) or vector(0)"
                                hide         = true
                                interval     = ""
                                legendFormat = ""
                                refId        = "C"
                            },
                        ]
                        thresholds  = []
                        title       = "Availability"
                        type        = "timeseries"
                    },
                  ~ {
                      ~ alert       = {
                          ~ name                = "ECS Memory Utilization alert" -> "staging RPC ECS Memory Utilization alert"
                            # (9 unchanged attributes hidden)
                        }
                        # (8 unchanged attributes hidden)
                    },
                  ~ {
                      ~ alert       = {
                          ~ name                = "ECS CPU Utilization alert" -> "staging RPC ECS CPU Utilization alert"
                            # (9 unchanged attributes hidden)
                        }
                        # (8 unchanged attributes hidden)
                    },
                    {
                        collapsed = false
                        gridPos   = {
                            h = 1
                            w = 24
                            x = 0
                            y = 10
                        }
                        panels    = []
                        title     = "Status codes"
                        type      = "row"
                    },
                    # (15 unchanged elements hidden)
                    {
                        collapsed  = false
                        datasource = {
                            type = "datasource"
                            uid  = "grafana"
                        }
                        gridPos    = {
                            h = 1
                            w = 24
                            x = 0
                            y = 55
                        }
                        panels     = []
                        targets    = [
                            {
                                datasource = {
                                    type = "datasource"
                                    uid  = "grafana"
                                }
                                refId      = "A"
                            },
                        ]
                        title      = "Database"
                        type       = "row"
                    },
                  ~ {
                      ~ alert       = {
                          ~ conditions          = [
                              ~ {
                                  ~ evaluator = {
                                      ~ params = [
                                          - 50,
                                          + 95,
                                        ]
                                        # (1 unchanged attribute hidden)
                                    }
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ evaluator = {
                                      ~ params = [
                                          - 50,
                                          + 95,
                                        ]
                                        # (1 unchanged attribute hidden)
                                    }
                                    # (4 unchanged attributes hidden)
                                },
                            ]
                            name                = "staging CPU/Memory alert"
                            # (8 unchanged attributes hidden)
                        }
                      ~ fieldConfig = {
                          ~ defaults  = {
                              ~ thresholds = {
                                  ~ steps = [
                                        {
                                            color = "green"
                                            value = null
                                        },
                                      ~ {
                                          ~ value = 50 -> 95
                                            # (1 unchanged attribute hidden)
                                        },
                                    ]
                                    # (1 unchanged attribute hidden)
                                }
                                # (3 unchanged attributes hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (6 unchanged attributes hidden)
                    },
                ]
                tags                 = []
                # (17 unchanged attributes hidden)
            }
        )
        id           = "0:staging_rpc-proxy"
        # (7 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*